/*Завдання№1 Лабараторна робота №4...*/
#include <stdio.h>
#include <math.h>//Підключаємо необхідніо для роботи бібліотеки

int main() {
    int x, y, z;//ОГОлошуємо змінні
    double b;

    // просимо улюбленного юзера ввести значень змінних
    printf("Введіть значення x: ");
    scanf_s("%d", &x);
    printf("Введіть значення y: ");
    scanf_s("%d", &y);
    printf("Введіть значення z: ");
    scanf_s("%d", &z);

    // Перевірка допустимості вхідних параметрів
    while (x == 0 || (pow(x, 4) / 2) == 0 || sin(z) == 0) {
        printf("Для заданих значень x, y та z в обчислюваному виразі виконується ділення на 0 або інша недопустима операція.\n");//Виводимо помилку в разі необхідності 
        printf("Будь ласка, введіть інші значення:\n");// Просимо юзера ввести значення ще раз

        printf("Значення x: ");
        scanf_s("%d", &x);
        printf("Значення y: ");
        scanf_s("%d", &y);
        printf("Значення z: ");
        scanf_s("%d", &z);
    }

    // Обчислення значення функції
    b = 1 + cos(y - 2) / (pow(x, 4) / 2) - pow(sin(z), 2);

    // Виведення результату
    printf("Значення функції b: %lf\n", b);
    //Кінець програми)
    return 0;//<-Ретурн зіро
}
